class Translation(object):
    START_TEXT = """Hello 👋,
You are warnly welcome to Leo URL Upload Bot🙂!

<b>Please send me any direct download URL Link, i can upload to telegram as File/Video</b>

Use /help for more details😶

Made By : @naviya2 🇱🇰
Support Group : @leosupportx 🇱🇰
© @SpEcHlDe , @TGBotsZ & @CWProjects"""
    RENAME_403_ERR = "සොරි ඔයාට අවසරයක් නැහැ මේ ෆයිල් එක Rename කරන්න😐."
    ABS_TEXT = "කරුණාකර ආත්මාර්තකාමී වෙන්න එපා🤚"
    UPGRADE_TEXT = "<b>👉 ඔයාගෙම clone බොට් එක සාදාගැනීමට අවශ්‍යනම්.. </b>  /help command එක භාවිතා කරන්න🙂"
    FORMAT_SELECTION = "අපේක්ශිත ආකෘතිය තෝරන්න: <a href='{}'>file size might be approximate</a> \nඔයාට custom thumbnail එකක් යූස් කරන්න ඕන නම්,පහල බටන් ක්ලික් කිරීමට කලින් ඉක්මනට Thumbnail Photo එක එවන්න.\nඔයාට /deletethumbnail Command එක මගින් Auto Generate උන Thumbnail එක අයින් කරගන්න පුලුවන්😊."
    SET_CUSTOM_USERNAME_PASSWORD = """ඔයාට premium videos Download කිර්‍රමට අවශ්‍යනම්,පහත ආකෘතියට අනුව ඇතුලත් කරන්න🙂:
URL | filename | username | password"""
    NOYES_URL = "@robot URL detected. කරුණාකර මෙම site එක භාවිතා කර https://shrtz.me/PtsVnf6 වේගවත් URL එකක් ලබාගෙන මට ලබාදෙන්න එවිට මම අනෙකුත් users ල සදහා slow down වීම වලක්වා ගත හැකිවේ😊."
    DOWNLOAD_START = "Download කිරීමට උත්සහ දරමින් සිටී🙂"
    UPLOAD_START = "දැන් අප්ලෝඩ් වෙමින් පවතී🙂"
    RCHD_BOT_API_LIMIT = "උපරිම ධාරිතාව වන (50MB) ට වැඩි දේවල් අප්ලෝඩ් කිරීමට අපහසුය😐. එහෙත් අප්ලෝඩ් කිරීමට උත්සහ දරමින් පවතී🙂."
    RCHD_TG_API_LIMIT = "මේ කාලය ඇතුලත  ඩවින්ලෝඩ් උනා😊{} seconds.\nDetected File Size: {}\nSorry ඒත් මට මේ ෆයිල් එක අප්ලෝඩ් කල නොහැක මක්නිසාදයත් Telegram හි අප්ලෝඩ් ලිමිට් එක 1.5gb වන නිසාය😐."
    AFTER_SUCCESSFUL_UPLOAD_MSG = "මාව ප්‍රයෝජනවත් වෙනව කියල හිතෙනවනම් මේ චැනල් එකට ජොයින් වෙන්න අලුත් අප්ඩේට්ස් දැනගන්න🙂. Join : @new_ehi"
    AFTER_SUCCESSFUL_UPLOAD_MSG_WITH_TS = "Download උනා {} seconds ඇතුලත😊. \nJoin : @TGBotsZ \nUpload උනා {} seconds ඇතුලත."
    NOT_AUTH_USER_TEXT = "Please /upgrade your subscription."
    NOT_AUTH_USER_TEXT_FILE_SIZE = "Detected File Size: {}. Free Users ලට පුලුවන් වෙන්නෙ මේ ප්‍රමානය විතරයි: {}\nඑමනිසා ඔයාගෙ subscription එක /upgrade කරගන්න.\nමෙය අපගේ දෝශයක් යැයි ඔයාට හිතෙනවනම් අපේ support group එකෙහි පළ කරන්න<a href='https://telegram.dog/ThankTelegram'>@leosupportx</a>"
    SAVED_CUSTOM_THUMB_NAIL = "Custom thumbnail එක සේව් උනා මේ thumbnail එක මෙතැන් සිට videos /files සදහා යොදා ගැනේ🙂"
    DEL_ETED_CUSTOM_THUMB_NAIL = "✅ Custom thumbnail එක delete කිරීම සාර්ථකයි🙂"
    FF_MPEG_DEL_ETED_CUSTOM_MEDIA = "✅ Media clear කිරීම සාර්ථකයි🙂."
    SAVED_RECVD_DOC_FILE = "Document එක Download කිරීම සාර්ථකයි🙂"
    CUSTOM_CAPTION_UL_FILE = " "
    NO_CUSTOM_THUMB_NAIL_FOUND = "Custom Thumbnail එකක් නොමැත."
    NO_VOID_FORMAT_FOUND = "ERROR...\n<b>YouTubeDL</b> said: {}"
    USER_ADDED_TO_DB = "User <a href='tg://user?id={}'>{}</a> added to {} till {}."
    CURENT_PLAN_DETAILS = """දැනට ඔයාට පවතින plan එක පිලිබද තොරතුරු😶
--------
Telegram ID: <code>{}</code>
Plan name: Free User
Expires on:Exp වෙන්නෙ නැතෝ😁"""
    HELP_USER = """Hi i am Leo URL Uploader bot..
    
1. Send url (Link|New Name with Extension).(ලින්ක් එක යවන්න)
2. Send Custom Thumbnail (Optional).(custom thumbnail එක යවන්න)
3. Select the button.
   SVideo - Give File as video with Screenshots(වීඩියෝ එකත් සමග screenshots ලබාගතහැක)
   DFile  - Give File with Screenshots (ෆයිල් එක සමග screenshots ලබා ගත හැක)
   Video  - Give File as video without Screenshots (වීඩියෝව පමනක් ලබගැනිමට)
   DFile  - Give File without Screenshots (ෆයිල් එක පමණක් ලබාගැනිමට)
   
<b>👉 Create own Clone Bot :</b> 👉 <a href="https://youtu.be/QkAkSLBgoYw">Diploy</a>

--------
දැනට ඔයාගෙ පවතින plan එක දැනගැනීමට  /me කමාන්ඩ් එක භාවිතා කරන්න😊

Support Group : @leosupportx 🇱🇰
© @new_ehi"""
    REPLY_TO_DOC_GET_LINK = "මෙහෙම reply කරන්න media file එකකට එතකොට අදාල direct download link එක ඉක්මනටම ගන්න පුලුවන්😊"
    REPLY_TO_DOC_FOR_C2V = "මෙහෙම reply කරහම අදාල media file එක convert කරගන්න පුලුවන්😶"
    REPLY_TO_DOC_FOR_SCSS = "Reply "
    REPLY_TO_DOC_FOR_RENAME_FILE = "මෙහෙම reply කරහම  /rename කරගන්න වගේම custom thumbnail support එකද ලබාගත හැකිය😊"
    AFTER_GET_DL_LINK = "Direct Link <a href='{}'>Generated</a> valid for {} days.\n© @leourluploadbot 🇱🇰"
    FF_MPEG_RO_BOT_RE_SURRECT_ED = """Syntax: /trim HH:MM:SS [HH:MM:SS]"""
    FF_MPEG_RO_BOT_STEP_TWO_TO_ONE = "පලමුව /downloadmedia ලෙස ඕනම telegram media file එකකට reply කරහම ඒ media file එක local මට ඩවුන්ලෝඩ් කරන්න පුලුවන්. \n /storageinfo ලෙස යැවූ විට ඩවුලෝඩ් කල media file එක ගැන තොරතුරු දැන ගත හැකිය."
    FF_MPEG_RO_BOT_STOR_AGE_INFO = "Video Duration: {}\nSend /clearffmpegmedia to delete this media, from my storage.\nSend /trim HH:MM:SS [HH:MM:SS] to cu[l]t a small photo / video, from the above media."
    FF_MPEG_RO_BOT_STOR_AGE_ALREADY_EXISTS = "මේ ෆයිල් එක දැනටමත් අපේ local storage එක තුල තිබේ😊.\n එනිසා /storageinfo ලෙස send කර එම media file එක ගැන තොරතුරු දැන ගත හැක😶."
    USER_DELETED_FROM_DB = "User <a href='tg://user?id={}'>{}</a> DataBase එකෙන් delete කලා😶."
    REPLY_TO_DOC_OR_LINK_FOR_RARX_SRT = "මෙහෙම telegram media (MKV) ෆයිලයකට reply කලවිට එම media file එකට අදාල embedded streams ලබාගතහැක😊"
    REPLY_TO_MEDIA_ALBUM_TO_GEN_THUMB = "/generatecustomthumbnail ලෙස media album එකකට රිප්ලයි කලපසු එම media album එකට custom thumbnail එකක් generate කරගත හැක🙂"
    ERR_ONLY_TWO_MEDIA_IN_ALBUM = "Media Album එක තුල තිබිය හැක්කෙ Photos දෙකක් පමණි එනිසා media album එකට photos දෙකක් පමණක් ඇතුලත් වනසේ නැවත එවන්න😶."
    INVALID_UPLOAD_BOT_URL_FORMAT = "URL එකෙහි format එක වැරදියි. නැවත බලන්න ලින්ක් එක http:// or https:// වලින් start වෙන URL එකක්ද කියල🤔.ඔයාට format link එක භාවිතයෙන් custom name එකක් rename කරගන්න පුලුවන් | file_name.extension"
    ABUSIVE_USERS = "ඔයාට මේ බොට් එක භාවිතා කරන්න දෙන්න බැහ්😐.ඔයා මේක mistake එකක් කියල හිතනවනම් /me කමාන්ඩ් එක භාවිතයෙන් නැවත restriction එක ඉවත් කරගන්න🙂"
    FF_MPEG_RO_BOT_AD_VER_TISE_MENT = "https://telegram.dog/FFMpegRoBot"
    EXTRACT_ZIP_INTRO_ONE = "පලමුව compressed ෆයිල් එක එවන්න,ඉන්පසු /unzip command එක භාවිතයෙන් unzip කරගන්න😊."
    EXTRACT_ZIP_INTRO_THREE = " ෆයිල් එක Analyze වෙමින් පවතී ⚠️ මේ සදහා පොඩි වෙලාවක් ගතවෙයි ඒ නිසා පොඩ්ඩක් සංසුන්ව රැදී ඉම්න🙂"
    UNZIP_SUPPORTED_EXTENSIONS = ("zip", "rar")
    EXTRACT_ZIP_ERRS_OCCURED = "Sorry. Errors වගයක් ආවා compressed file එක සැකසීමේදී😐.එනිසා නැවත පොඩ්ඩක් චෙක් කරල, ඒත් ගැටලුව පවතිනවනම් අපේ support group එකෙහි massege එකක් දමන්න🙂 <a href='https://telegram.dog/ThankTelegram'>@leosupportx</a>"
    EXTRACT_ZIP_STEP_TWO = """පහල options මගින් අදාල file_name එක select කරන්න upload කිරීම සදහා😊
ෆයිල් එක ඔයාට ලැබුන පසු /rename command එක මගින් අදාල ෆයිල් එක rename කරගත හැක custom thumbnail එකක් සමග🙂"""
    CANCEL_STR = "ක්‍රියාවලිය cancel කරන ලදි😐"
    ZIP_UPLOADED_STR = "අප්ලෝඩ් කරන ලදි {} files in {} seconds"
    FREE_USER_LIMIT_Q_SZE = """ක්‍රියාවලිය සිදුකල නොහැක.
free user කෙනෙක්ට මිනිත්තු 30 කට 1 වරක් පමණක් සිදුකලහැක😐.
මේ සදහා ඔබට /upgrade කිරීම හෝ නැවත තත්පර 1800 කට පසු නැවත භාවිතා කල හැකිය🙂"""
    SLOW_URL_DECED = "මෙය ඉතාමත් ස්ලෝ URL එකකි. Since you were screwing my home,ඔයා මේ ලින්ක් එකෙන් ගිහින් අදාල fastest url එක ලබාගන්නා තුරු අප්ලෝඩ් කිරීම ප්‍රමාද වේ ඒනිසා මෙ ලින්ක් එකෙන් ගිහින් අදාල ලින්ක් එක ලබාගන්න:==> https://shrtz.me/PtsVnf6 එවිට අනෙකුත් මගේ users ලට මාව කිසිම slowdown වීමකින් තොරව භාවිතා කල හැකිය😊"
